OpenFOAM-dev/tutorials/compressibleVoF/throttle/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0];

internalField   uniform 300e5;

boundaryField
{
    inlet
    {
        type            prghTotalPressure;
        p0              uniform 300e5;
    }

    outlet
    {
        type            prghTotalPressure;
        p0              uniform 100e5;
    }

    walls
    {
        type            fixedFluxPressure;
    }

    frontBack
    {
        type            empty;
    }
}

// ************************************************************************* //
